#include "defineConfig.h"
#include "structConfig.h"
/*全局变量*/

#ifndef _GLOBALC_H_   
#define _GLOBALC_H_ 
//你 
Character me;
//最大生命值
int maxHP = initHP; 
//初始化所有武器
Weapon weapons[weaponCount] = {{"屠龙刀", 800, 15000, 9},
							   {"倚天剑", 720, 12000, 9},
							   {"轮回剑", 640, 8000, 8},
							   {"破天弓", 580, 7000, 7},
							   {"混沌剑", 520, 6000, 6},
							   {"流云矛", 460, 5000, 5},
							   {"衍天尺", 400, 4000, 4},
							   {"断空刀", 320, 3000, 3},
							   {"凌寒剑", 240, 2000, 2},
							   {"碧血刀", 120, 1000, 1}}; 

//初始化所有药 
Drug drugs[drugCount] = {{"生生造化丹", 4000, 5000, 3},
						 {"九转灵宝丸", 2500, 3000, 2},
						 {"九花玉露丸", 1500, 2000, 1},
						 {"雪参玉蟾丸", 1000, 1200, 3},
						 {"回阳五龙膏", 600, 800, 2},
						 {"少林玉灵散", 300, 400, 1}};

//初始化所有怪物
Monster monsters[monsterCount] = {{"凤凰", 80, 100, 4000, 300, 1000, 2000, 0.11},
								  {"麒麟", 70, 100, 3000, 250, 1000, 2000, 0.08},
								  {"穷奇", 60, 95, 2000, 200, 1000, 2000, 0.05},
								  {"混沌", 50, 80, 1000, 120, 1000, 2000, 0.04},
								  {"饕餮", 40, 60, 1000, 100, 1000, 2000, 0.03},
								  {"白泽", 30, 50, 800, 80, 1000, 2000, 0.02},
								  {"重鸣", 20, 45, 600, 80, 1000, 2000, 0.02},
								  {"毕方", 0, 35, 400, 60, 1000, 2000, 0.01}};				 
					
#endif  